#include "stdafx.h"

/****************************************************************/
/*																*/
/*					汎用サブルーチン							*/
/*																*/
/****************************************************************/
//==============================================================
//		ストリームのサイズを得る
//--------------------------------------------------------------
//	●引数
//			FileInfo *file	ファイル情報の構造体
//	●返値
//			file->size		ストリームのサイズ
//==============================================================
size_t getStreamSize(FILE *fStream){

	//----------------------------------
	//■Local 変数
	size_t	ptCUR;
	size_t	szSize;

	ptCUR=ftell(fStream);				//ストリームのサイズを得る
	fseek(fStream,0,SEEK_END);			//ストリームのポインタを最後に
	szSize=ftell(fStream);				//ストリームのサイズを得る
	fseek(fStream,ptCUR,SEEK_SET);		//ストリームのポインタを元の位置に

	return(szSize);
};
//==============================================================
//		ストリーム・ポインタを進める
//--------------------------------------------------------------
//	●引数
//			FileInfo *file	ファイル情報の構造体
//			__int32		iSize		サイズ
//	●返値
//			無し
//==============================================================
void StreamPointerAdd(FILE *stream,__int32 iSize){

	fseek(stream,(long)iSize,SEEK_CUR);

};
